#include <opencv2/core/core.hpp>
#include <opencv2/highgui/highgui.hpp>
#include <opencv2/imgproc.hpp>
#include <opencv2/opencv.hpp>

using namespace cv;
using namespace std;

int main() {
    // 1. Завантаження зображень

    // 2. Виконати програмну реалізацію алгоритму для розпізнавання заданого кольору на зображенні.
    // В якості міри приналежності кольору заданому використовувати різницю значень кольорів пікселів

    // 3. Виконати розпізнавання кольору на зображенні, використовуючи функцію floodFill.

    // 4. Виконати сегментацію зображення за допомогою алгоритму GrabCut.

    // 5. Виконати розпізнавання кольору для зображення у колірних системах LAB та HSV.

    // 6.	Встановити постійну яскравість усім пікселям зображення в системі HSV.
    // Відобразіть результат та його гістограму.

    // 7. Виконати розпізнавання тону шкіри.

    return 0;
}
